app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT `events`.* FROM `events`